{"class_name": "Model", "keras_version": "2.1.3", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 5312], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 100, "trainable": true, "embeddings_regularizer": null, "input_dim": 153, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 5312], "activity_regularizer": null, "input_length": 5312}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Reshape", "config": {"target_shape": [166, 32, 100], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "InputLayer", "config": {"dtype": "int32", "batch_input_shape": [null, 166], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cu_dnnlstm_1", "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "go_backwards": false, "activity_regularizer": null, "trainable": true, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "return_sequences": false, "unit_forget_bias": true, "recurrent_constraint": null}}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cu_dnnlstm_2", "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "go_backwards": true, "activity_regularizer": null, "trainable": true, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "return_sequences": false, "unit_forget_bias": true, "recurrent_constraint": null}}, "trainable": true, "name": "time_distributed_2"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "time_distributed_2"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_2", "dtype": "float32", "output_dim": 300, "trainable": 1, "embeddings_regularizer": null, "input_dim": 2048, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 166], "activity_regularizer": null, "input_length": 166}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}], ["time_distributed_2", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cu_dnnlstm_3", "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "go_backwards": false, "activity_regularizer": null, "trainable": true, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "return_sequences": false, "unit_forget_bias": true, "recurrent_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "cu_dnnlstm_3"}, {"class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "cu_dnnlstm_4", "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "go_backwards": true, "activity_regularizer": null, "trainable": true, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "return_sequences": false, "unit_forget_bias": true, "recurrent_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "cu_dnnlstm_4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "inbound_nodes": [[["cu_dnnlstm_3", 0, 0, {}], ["cu_dnnlstm_4", 0, 0, {}]]], "name": "concatenate_3"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_1"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}